app/views/dashboard/_company.html.erb

                    <div class="font-size-sm font-w600 text-uppercase text-muted">lojas</div>
                    <div class="font-size-h2 font-w400 text-dark"><%= current_user.company.stores.count %></div>
---
SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = $1 LIMIT $2  [["user_id", 1439], ["LIMIT", 1]]
SELECT COUNT(*) FROM "stores" WHERE "stores"."company_id" = $1  [["company_id", 32]]

                    <div class="font-size-sm font-w600 text-uppercase text-muted">produtos</div>
                    <div class="font-size-h2 font-w400 text-dark"><%= current_user.company.products.count %></div>
---
SELECT COUNT(*) FROM "products" INNER JOIN "stores" ON "products"."store_id" = "stores"."id" WHERE "stores"."company_id" = $1  [["company_id", 32]]

                    <div class="font-size-sm font-w600 text-uppercase text-muted">facturas processadas</div>
                    <div class="font-size-h2 font-w400 text-dark"><%= current_user.company.facturas.count %></div>
---
SELECT COUNT(*) FROM "facturas" INNER JOIN "stores" ON "facturas"."store_id" = "stores"."id" WHERE "stores"."company_id" = $1  [["company_id", 32]]