app/views/dashboard/_customer.html.erb

                    <% else %>
                        <% if current_user.profile.iban.present? && current_user.profile.account_number.present? %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1473], ["LIMIT", 1]]