app/views/profiles/_modal_history.erb

                            <tbody>
                                <% @profile.moviments.order("created_at DESC").each do |moviment| %>
---
SELECT "moviments".* FROM "moviments" WHERE "moviments"."profile_id" = $1 ORDER BY created_at DESC  [["profile_id", 1395]]