app/views/profiles/edit.html.erb

                                                <%= f.input :operating_sector, :as => :select, :collection => Profile.operating_sectors.map { |key, value| [key, key] }, label: "Sector de atuação" %>
                                                <%= f.association :occupationArea, :collection => OccupationArea.all.map { |element| [element.occupation, element.id] }, include_blank: false, label: "Selecione a área de atuação" %>
---
SELECT "occupation_areas".* FROM "occupation_areas"