app/views/profiles/profiles_pending.html.erb

SELECT COUNT(*) FROM "profiles" WHERE "profiles"."status" = $1  [["status", 0]]
---
                            <div class="font-size-sm font-w600 text-uppercase text-white text-muted">Clientes novos/Pendentes</div>
                            <div class="font-size-h2 font-w400 text-white"><%= Profile.where(status: 0).count %></div>