app/views/profiles/profiles_active.html.erb

SELECT COUNT(*) FROM "profiles" WHERE "profiles"."status" = $1  [["status", 1]]
---
                            <div class="font-size-sm font-w600 text-uppercase text-white text-muted">Clientes Aprovados/Activos</div>
                            <div class="font-size-h2 font-w400 text-white"><%= Profile.where(status: 1).count %></div>