app/views/profiles/show.html.erb

SELECT "moviments".* FROM "moviments" WHERE "moviments"."profile_id" = $1  [["profile_id", 1395]]
---
                    <li>
                        <% if @profile.moviments.present? %>