app/views/stores/_details.html.erb


                <% @store.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."store_id" = $1  [["store_id", 27]]