app/views/stores/_form_add_product.html.erb

SELECT "products".* FROM "products" WHERE "products"."store_id" = $1  [["store_id", 27]]
---
            <div class="form-group">
                <%= f.input :product_id,
                    :as => :select, :collection => @store.products.map { |product| ["#{product.name} - #{product.price_with_commission.to_kwanza}", product.id] },
                    input_html: { class: 'js-select2' },
                    label: false,
                    placeholder: "Selecione o produto.."