app/views/stores/_purchases_list.html.erb

            <tbody>
                <% @store.facturas.each do |factura| %>
---
SELECT "facturas".* FROM "facturas" WHERE "facturas"."store_id" = $1  [["store_id", 27]]