app/views/stores/details_of_current_order.html.erb

            <div class="col-6 col-md-6 text-right">
                <% if @pre_order.item_orders.count > 0 %>
---
SELECT COUNT(*) FROM "item_orders" WHERE "item_orders"."pre_order_id" = $1  [["pre_order_id", 62]]