app/views/stores/show.html.erb


                        <% if @store.products.present? %>
---
SELECT "products".* FROM "products" WHERE "products"."store_id" = $1  [["store_id", 27]]

                <div class="font-size-sm font-w600 text-muted text-uppercase">Productos</div>
                <a class="link-fx font-size-h3" href="javascript:void(0)"><%= @store.products.count %></a>
---
SELECT COUNT(*) FROM "products" WHERE "products"."store_id" = $1  [["store_id", 27]]