app/views/stores/itemOrder/_list_itens.html.erb

<% pre_order.item_orders.each do |item| %>
---
SELECT "item_orders".* FROM "item_orders" WHERE "item_orders"."pre_order_id" = $1  [["pre_order_id", 62]]