app/views/companies/index.html.erb

SELECT COUNT(*) FROM "companies" WHERE "companies"."name" IS NOT NULL AND "companies"."status" = $1  [["status", true]]
---
                                    <div class="font-size-sm font-w600 text-uppercase text-white text-muted">Empresas activas</div>
                                    <div class="font-size-h2 font-w400 text-white"><%= Company.where.not(name: nil).where(status: true).count %></div>

SELECT COUNT(*) FROM "companies" WHERE "companies"."name" IS NOT NULL AND "companies"."status" = $1  [["status", false]]
---
                                    <div class="font-size-sm font-w600 text-uppercase text-muted text-white">Empresas inactivas</div>
                                    <div class="font-size-h2 font-w400 text-white"><%= Company.where.not(name: nil).where(status: false).count %></div>