app/views/companies/show.html.erb

SELECT COUNT(*) FROM "stores" WHERE "stores"."company_id" = $1  [["company_id", 32]]
---
                <div class="font-size-sm font-w600 text-muted text-uppercase">Quant. Lojas</div>
                <a class="link-fx font-size-h3" href="javascript:void(0)"><%= @company.stores.count %></a>

SELECT COUNT(*) FROM "products" INNER JOIN "stores" ON "products"."store_id" = "stores"."id" WHERE "stores"."company_id" = $1  [["company_id", 32]]
---
                <div class="font-size-sm font-w600 text-muted text-uppercase">Quant. Produtos</div>
                <a class="link-fx font-size-h3" href="javascript:void(0)"><%= @company.products.count %></a>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1439], ["LIMIT", 1]]
---
                        <% if current_user.admin? %>
                            <% if @company.user.present? %>

SELECT "recibos".* FROM "recibos" INNER JOIN "facturas" ON "recibos"."factura_id" = "facturas"."id" INNER JOIN "stores" ON "facturas"."store_id" = "stores"."id" WHERE "stores"."company_id" = $1  [["company_id", 32]]
---
                <div class="block-content">
                    <% @company.recibos.each do |recibo| %>