app/helpers/application_helper.rb

SELECT "configurations".* FROM "configurations" ORDER BY "configurations"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def config
        Configuration.first

SELECT "configurations".* FROM "configurations" ORDER BY "configurations"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def version_app
        Configuration.first.version