app/controllers/companies_controller.rb

SELECT COUNT(*) FROM "companies" WHERE "companies"."name" IS NOT NULL
---
    def index
        if params[:search]
            @pagy, @companies = pagy(Company.search(params[:search]).where.not(name: nil).order('created_at DESC'), items: 10)
        else
            @pagy, @companies = pagy(Company.where.not(name: nil).order('created_at DESC'), items: 10)

INSERT INTO "users" ("email", "cell_phone", "role", "encrypted_password", "created_at", "updated_at", "confirmation_terms", "full_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def associate_user_company
        @company.create_access_user

INSERT INTO "companies" ("name", "nif", "address", "cell_phone", "created_at", "updated_at", "slug", "email", "category_id", "accountNumber", "iban") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "users" ("email", "cell_phone", "role", "encrypted_password", "created_at", "updated_at", "confirmation_terms", "full_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @company = Company.new(company_params_new)

        respond_to do |format|
            if @company.save
                @company.create_access_user