app/controllers/dashboard_controller.rb

SELECT "publicities".* FROM "publicities" WHERE "publicities"."status" = $1  [["status", true]]
SELECT COUNT(*) FROM "companies"
---
    def index
        @publicities = Publicity.all.where(status: true)

        puts "=================="
        #p current_user.sign_in_count
        puts "=================="

        #redirect_to edit_user_password_path if current_user.sign_in_count == 0


        if current_user.admin?
            @companies = Company.all