app/controllers/invoices_controller.rb

    def sales
        @invoices = current_user.company.facturas.order("created_at DESC")
---
SELECT "facturas".* FROM "facturas" INNER JOIN "stores" ON "facturas"."store_id" = "stores"."id" WHERE "stores"."company_id" = $1 ORDER BY created_at DESC  [["company_id", 32]]
SELECT COUNT(*) FROM "facturas"

    def purchases
        @my_invoices = current_user.facturas.order("created_at DESC")
---
SELECT "facturas".* FROM "facturas" WHERE "facturas"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1436]]

        def set_invoice
            @factura = Factura.friendly.find(params[:factura_id])
---
SELECT "facturas".* FROM "facturas" WHERE "facturas"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

        def set_recibo
            @recibo = Recibo.friendly.find(params[:id])
---
SELECT "recibos".* FROM "recibos" WHERE "recibos"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

        def set_adc
            @adc = Adc.friendly.find(params[:id])
---
SELECT "adcs".* FROM "adcs" WHERE "adcs"."id" = $1 LIMIT $2  [["id", 1395], ["LIMIT", 1]]