app/controllers/messages_controller.rb

  def index
    @pagy, @messages = pagy(Message.all.order('created_at DESC'), items: 10)

    @messages = Message.all
---
SELECT "messages".* FROM "messages"