app/controllers/moviments_controller.rb

  def create
    @moviment = Moviment.new(moviment_params)

    @moviment.user_id = current_user.id

    respond_to do |format|
      if @moviment.save
---
INSERT INTO "moviments" ("profile_id", "user_id", "is_credit", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["profile_id", 1395], ["user_id", 1], ["is_credit", false], ["amount", "80000.0"], ["created_at", "2021-10-11 14:33:00.637036"], ["updated_at", "2021-10-11 14:33:00.637036"]]

    def set_profile
      @profile = Profile.find(params[:profile])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1395], ["LIMIT", 1]]