app/controllers/occupation_areas_controller.rb

  def index
    @occupation_area = OccupationArea.new
    @occupation_areas = OccupationArea.all
---
SELECT "occupation_areas".* FROM "occupation_areas"