app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "real_price", "store_id", "created_at", "updated_at", "slug", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2021-10-11 12:51:09.166649"], ["id", 612]]