app/controllers/profiles_controller.rb

UPDATE "profiles" SET "updated_at" = $1 WHERE "profiles"."id" = $2  [["updated_at", "2022-01-15 12:29:56.865533"], ["id", 1395]]
---
    def adc_subscribed
        profile = current_user.profile
        profile.update(profile_params_adc)

UPDATE "profiles" SET "salary" = $1, "account_number" = $2, "updated_at" = $3 WHERE "profiles"."id" = $4  [["salary", "800000.0"], ["account_number", "0474.1019.3 "], ["updated_at", "2021-10-11 13:07:31.902857"], ["id", 1395]]
---
    def update
        respond_to do |format|
            if @profile.update(profile_params)

DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 1394]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1435]]
---
    def destroy
        user = @profile.user

        if current_user.customer?
            if user.is_active?
                user.inactive_user
            else
                user.active_user
            end

            destroy_user_session_path
            redirect_to root_path, notice: 'conta eliminada com sucesso.'
        else
            #msg = "Caro cliente\nA sua conta Paga3 foi desactivada por não cumprir com os requisitos solicitados em nosso sistema, desde ja agradeços."
            #SendSMS.new( msg, user.cell_phone ).wesender

            @profile.destroy