app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests"
---
  def index
    @requests = Request.all

UPDATE "requests" SET "status" = $1 WHERE "requests"."id" = $2  [["status", 5], ["id", 3]]
---
  def cancel_my_request
    @request.update_columns(status: 5)

INSERT INTO "requests" ("profile_id", "store", "address", "cell_phone", "email", "product", "price", "render_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @request = Request.new(request_params)
    @request.profile_id = current_user.profile.id

    respond_to do |format|
      if @request.save

UPDATE "requests" SET "render_number" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["render_number", 4], ["updated_at", "2021-12-16 10:40:09.517761"], ["id", 34]]
---
  def update
    respond_to do |format|
      if @request.update(request_params)

SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_request
      @request = Request.find(params[:id])