app/controllers/site_controller.rb

SELECT "partners".* FROM "partners" WHERE "partners"."status" = $1  [["status", true]]
---
    def index
        @partners = Partner.where(status: true)

SELECT "partners".* FROM "partners" WHERE "partners"."status" = $1  [["status", true]]
SELECT "companies".* FROM "companies" WHERE "companies"."show_in_site" = $1  [["show_in_site", true]]
---
    def empresas
        @partners = Partner.where(status: true)
        @companies = Company.where(show_in_site: true)