app/controllers/stores_controller.rb

  def consult_request
    search = params["search"]
    user = User.find_by(cell_phone: search["cell_phone"]) if params["search"].present?

    if user.present?
        @pre_order = PreOrder.create(profile_id: user.profile.id, store_id: @store.id)
---
SELECT "users".* FROM "users" WHERE "users"."cell_phone" = $1 LIMIT $2  [["cell_phone", "946562959"], ["LIMIT", 1]]
INSERT INTO "pre_orders" ("profile_id", "store_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["profile_id", 1395], ["store_id", 27], ["created_at", "2021-12-16 10:23:40.454618"], ["updated_at", "2021-12-16 10:23:40.454618"]]

  def validate_code_and_finish
    validation_code = params["validation_code"]

    if validation_code["code"].present?
        purchase_code = @pre_order.profile.user.purchase_codes.where(is_active: true).where(code: validation_code["code"]).first

        if purchase_code
            purchase_code.finish
            @pre_order.create_invoice(current_user)
---
SELECT "purchase_codes".* FROM "purchase_codes" WHERE "purchase_codes"."user_id" = $1 AND "purchase_codes"."is_active" = $2 AND "purchase_codes"."code" = $3 ORDER BY "purchase_codes"."id" ASC LIMIT $4  [["user_id", 1436], ["is_active", true], ["code", 6700], ["LIMIT", 1]]
INSERT INTO "item_orders" ("product_id", "pre_order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 612], ["pre_order_id", 63], ["created_at", "2021-10-11 13:10:14.099049"], ["updated_at", "2021-10-11 13:10:14.099049"]]

  def add_product_to_list
    search = params["search"]
    product = nil

    if search["product_id"].present?
      product = Product.find(search["product_id"])
    else
      redirect_to details_of_current_order_path(pre_order_id: @pre_order.id), alert: 'Produto não encontrado'
    end


    if product.present?
      if (@pre_order.profile.purchase_amount >= product.first_parcel) # && (@pre_order.total_to_pay + product.price_with_commission) <= @pre_order.profile.purchase_amount)
          ItemOrder.create(product_id: product.id, pre_order_id: @pre_order.id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 645], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1395], ["LIMIT", 1]]
INSERT INTO "item_orders" ("product_id", "pre_order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 645], ["pre_order_id", 95], ["created_at", "2021-12-16 10:23:49.895409"], ["updated_at", "2021-12-16 10:23:49.895409"]]

  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save
---
INSERT INTO "stores" ("name", "reference_number", "description", "location", "company_id", "created_at", "updated_at", "slug", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def set_store
      @store = Store.friendly.find(params[:id])
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]

    def set_factura
      @factura = Factura.friendly.find(params[:factura_id])
---
SELECT "facturas".* FROM "facturas" WHERE "facturas"."store_id" = $1  [["store_id", 27]]

    def set_pre_order
      @pre_order = PreOrder.find(params[:pre_order_id])
---
SELECT "item_orders".* FROM "item_orders" WHERE "item_orders"."pre_order_id" = $1  [["pre_order_id", 62]]
SELECT "pre_orders".* FROM "pre_orders" WHERE "pre_orders"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]