app/controllers/users_controller.rb

        def set_user
            @user = User.friendly.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1438], ["LIMIT", 1]]