app/models/adc.rb

  def generate_reference
    letter_code = "ADC"
    last_code = Adc.last
---
SELECT "adcs".* FROM "adcs" ORDER BY "adcs"."id" DESC LIMIT $1  [["LIMIT", 1]]