app/models/application_record.rb

SELECT "configurations".* FROM "configurations" ORDER BY "configurations"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def config
        Configuration.first