app/models/company.rb

    def create_access_user
        return
        old_user = nil
        pw = rand(2**256).to_s(36).ljust(8, 'a')[0..10]

        if self.user_id.present? #==================== Usuário existe mas não esta associado
            old_user = get_user_by_id(self.user_id)
            update_info_user(self, old_user, pw)
        else #==================== Usuário não existe, Busca pelo e-mail se existe um
            #old_user = get_user_by_email(self.email)
            user = User.create(
                full_name: self.name,
                email: self.email,
                cell_phone: self.cell_phone,
                confirmation_terms: true,
                role: 1,
                password: pw,
                password_confirmation: pw
            )

            self.update_columns(user_id: user.id)
---
INSERT INTO "users" ("email", "cell_phone", "role", "encrypted_password", "created_at", "updated_at", "confirmation_terms", "full_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "companies" SET "user_id" = $1 WHERE "companies"."id" = $2  [["user_id", 1439], ["id", 32]]

    def update_info_user(comapny, user, pw)
        comapny.update_columns(user_id: user.id)
---
UPDATE "companies" SET "user_id" = $1 WHERE "companies"."id" = $2  [["user_id", 1439], ["id", 32]]

    def get_user_by_id(user_id)
        return User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1439], ["LIMIT", 1]]