app/models/factura.rb

    def generate_reference
        letter_code = "FA"
        last_code = Factura.last
---
SELECT "facturas".* FROM "facturas" ORDER BY "facturas"."id" DESC LIMIT $1  [["LIMIT", 1]]