app/models/item_order.rb

    def update_values_of_pre_order
        self.pre_order.update_columns(total_general: self.pre_order.total_to_pay)
        self.pre_order.update_columns(total_commission: self.pre_order.total_of_commission_amount)
        self.pre_order.update_columns(total_without_commission: self.pre_order.total_of_real_price)
---
UPDATE "pre_orders" SET "total_general" = $1 WHERE "pre_orders"."id" = $2  [["total_general", "300000.0"], ["id", 63]]
UPDATE "pre_orders" SET "total_commission" = $1 WHERE "pre_orders"."id" = $2  [["total_commission", "50000.0"], ["id", 63]]
UPDATE "pre_orders" SET "total_without_commission" = $1 WHERE "pre_orders"."id" = $2  [["total_without_commission", "250000.0"], ["id", 63]]