app/models/pre_order.rb

    def largest_portion
        return 1 if self.products.blank?
---
SELECT "products".* FROM "products" INNER JOIN "item_orders" ON "products"."id" = "item_orders"."product_id" WHERE "item_orders"."pre_order_id" = $1  [["pre_order_id", 62]]

    def total_of_commission_amount
        self.products.sum(:commission_amount)
---
SELECT SUM("products"."commission_amount") FROM "products" INNER JOIN "item_orders" ON "products"."id" = "item_orders"."product_id" WHERE "item_orders"."pre_order_id" = $1  [["pre_order_id", 62]]

    def total_of_real_price
        self.products.sum(:real_price)
---
SELECT SUM("products"."real_price") FROM "products" INNER JOIN "item_orders" ON "products"."id" = "item_orders"."product_id" WHERE "item_orders"."pre_order_id" = $1  [["pre_order_id", 62]]

    def create_invoice(current_user)
        factura = Factura.new(
            user_id: self.profile.user.id,
            lojista_id: current_user.id,
            store_id: self.store.id,
            total_pagar: total_to_pay,
            valor_restante: total_to_pay,
            numero_parcelas: largest_portion,
            quantidade_produtos: self.products.count,
            valor_mensal_pagar: first_instalment,
            data_ultimo_pagamento: DateTime.now.end_of_month + 3.month
        )

        if factura.save
            self.products.each do |product|
                create_itens_invoice(factura, product)
            end

            #gerar o primeiro recibo que vai ser imprenso pelo lojista
            recibo = Recibo.create(factura_id: factura.id, valor: factura.valor_mensal_pagar)
            restante = (factura.valor_restante - recibo.valor)
            factura.update_columns(valor_restante: restante) if recibo.present?

            #Recalcula o valor da compra do cliente
            #value = (self.profile.purchase_amount - factura.valor_mensal_pagar)
            #self.profile.update_columns(purchase_amount: value)
            Moviment.create(
                profile_id: self.profile.id,
                user_id: current_user.id,
                is_credit: false,
                amount: factura.valor_mensal_pagar
            )
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
SELECT COUNT(*) FROM "products" INNER JOIN "item_orders" ON "products"."id" = "item_orders"."product_id" WHERE "item_orders"."pre_order_id" = $1  [["pre_order_id", 63]]
INSERT INTO "facturas" ("user_id", "lojista_id", "store_id", "total_pagar", "valor_restante", "numero_parcelas", "quantidade_produtos", "valor_mensal_pagar", "data_ultimo_pagamento", "created_at", "updated_at", "reference") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "recibos" ("factura_id", "valor", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["factura_id", 18], ["valor", "100000.0"], ["created_at", "2021-10-11 13:26:05.555793"], ["updated_at", "2021-10-11 13:26:05.555793"]]
INSERT INTO "moviments" ("profile_id", "user_id", "is_credit", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["profile_id", 1395], ["user_id", 1439], ["is_credit", false], ["amount", "100000.0"], ["created_at", "2021-10-11 13:26:05.577819"], ["updated_at", "2021-10-11 13:26:05.577819"]]

    def create_itens_invoice(factura, product)
        ItensFactura.create(
            factura_id: factura.id,
            name: product.name,
            real_price: product.real_price,
            render_number: product.render_number,
            price_with_commission: product.price_with_commission,
            commission_amount: product.commission_amount,
            code: product.code
        )
---
INSERT INTO "itens_facturas" ("factura_id", "name", "real_price", "render_number", "price_with_commission", "commission_amount", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"