app/models/product.rb

UPDATE "products" SET "commission_amount" = $1 WHERE "products"."id" = $2  [["commission_amount", "50000.0"], ["id", 612]]
UPDATE "products" SET "price_with_commission" = $1 WHERE "products"."id" = $2  [["price_with_commission", "300000.0"], ["id", 612]]
---
    def update_values
        self.update_columns(commission_amount: calc_commission_amount)
        self.update_columns(price_with_commission: calc_price_with_commission)

UPDATE "products" SET "code" = $1 WHERE "products"."id" = $2  [["code", "PAGA300001/2021"], ["id", 612]]
---
    def generate_code
        new_code = create_uniq_code
        self.update_columns(code: new_code)

SELECT "products".* FROM "products"
---
    def self.all_of_request
        products = Product.all.map{|product| product.name}

SELECT "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def create_uniq_code
        letter_code = "PAGA3"
        last_code = Product.last