app/models/profile.rb

    def solicitation_pending
        !self.requests.where(status: 0).any?
---
SELECT 1 AS one FROM "requests" WHERE "requests"."profile_id" = $1 AND "requests"."status" = $2 LIMIT $3  [["profile_id", 1395], ["status", 0], ["LIMIT", 1]]

    def active_editable
        self.update_columns(can_edit: false)
---
UPDATE "profiles" SET "can_edit" = $1 WHERE "profiles"."id" = $2  [["can_edit", false], ["id", 1397]]

    def aprove
        self.update_columns(status: 1)
---
UPDATE "profiles" SET "percentage_valid" = $1 WHERE "profiles"."id" = $2  [["percentage_valid", "320000.0"], ["id", 1395]]

    def reject
        self.update_columns(status: 3)
---
UPDATE "profiles" SET "percentage_valid" = $1 WHERE "profiles"."id" = $2  [["percentage_valid", "320000.0"], ["id", 1395]]

    def valid_percentage
        self.update_columns(percentage_valid: calc_parcels)
---
UPDATE "profiles" SET "purchase_amount" = $1 WHERE "profiles"."id" = $2  [["purchase_amount", "320000.0"], ["id", 1395]]

    def add_purchase_amount
        self.update_columns(purchase_amount: calc_parcels)
---
UPDATE "profiles" SET "purchase_amount" = $1 WHERE "profiles"."id" = $2  [["purchase_amount", "320000.0"], ["id", 1395]]

    def reduce_parcels(admin_id = nil, amount_to_discount, is_credit)
        old_purchase_amount = self.purchase_amount
        amount = (self.purchase_amount - amount_to_discount.to_f)

        if self.update_columns(purchase_amount: amount)
---
UPDATE "profiles" SET "purchase_amount" = $1 WHERE "profiles"."id" = $2  [["purchase_amount", "180000.0"], ["id", 1395]]

    def update_purchase_amount
        total_debit = self.moviments.where(is_credit: false).sum(:amount)
        total_credit = self.moviments.where(is_credit: true).sum(:amount)
        amount = total_credit - total_debit

        if self.update_columns(purchase_amount: amount)
---
SELECT SUM("moviments"."amount") FROM "moviments" WHERE "moviments"."profile_id" = $1 AND "moviments"."is_credit" = $2  [["profile_id", 1395], ["is_credit", true]]
UPDATE "profiles" SET "purchase_amount" = $1 WHERE "profiles"."id" = $2  [["purchase_amount", "280000.0"], ["id", 1395]]