app/models/purchase_code.rb

UPDATE "purchase_codes" SET "is_active" = $1 WHERE "purchase_codes"."id" = $2  [["is_active", false], ["id", 22]]
---
    def finish
        self.update_columns(is_active: false)

SELECT 1 AS one FROM "purchase_codes" WHERE "purchase_codes"."code" = $1 LIMIT $2  [["code", 7862], ["LIMIT", 1]]
---
    def self.generate_code
        loop do
            code = rand.to_s[2..5].to_i #SecureRandom.uuid
            break code unless PurchaseCode.where(code: code).exists?