app/models/request.rb

UPDATE "requests" SET "status" = $1 WHERE "requests"."id" = $2  [["status", 3], ["id", 2]]
---
    def approve_request
        self.update_columns(status: 3)

UPDATE "requests" SET "status" = $1 WHERE "requests"."id" = $2  [["status", 4], ["id", 2]]
INSERT INTO "facturas" ("user_id", "lojista_id", "store_id", "total_pagar", "valor_restante", "numero_parcelas", "quantidade_produtos", "valor_mensal_pagar", "data_ultimo_pagamento", "created_at", "updated_at", "reference") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "recibos" ("factura_id", "valor", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["factura_id", 52], ["valor", "72000.0"], ["created_at", "2021-10-16 10:34:40.407832"], ["updated_at", "2021-10-16 10:34:40.407832"]]
INSERT INTO "moviments" ("profile_id", "user_id", "is_credit", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["profile_id", 1395], ["user_id", 1436], ["is_credit", false], ["amount", "72000.0"], ["created_at", "2021-10-16 10:34:40.428859"], ["updated_at", "2021-10-16 10:34:40.428859"]]
---
    def confirmation_request(current_user)
        self.update_columns(status: 4)

        #store = Company.find_by(slug: 'loja-paga-3')

        factura = Factura.new(
            user_id: self.profile.user.id,
            lojista_id: current_user.id,
            store_id: 1,
            total_pagar: calc_price_with_commission,
            valor_restante: (calc_price_with_commission - first_parcel),
            numero_parcelas: self.render_number.to_i,
            quantidade_produtos: 1,
            valor_mensal_pagar: first_parcel,
            data_ultimo_pagamento: DateTime.now.end_of_month + (self.render_number.to_i).month
        )

        if factura.save
            recibo = Recibo.create(factura_id: factura.id, valor: first_parcel)

            Moviment.create(
                profile_id: self.profile.id,
                user_id: current_user.id,
                is_credit: false,
                amount: first_parcel
            )