app/models/store.rb

  def self.all_of_request
    stores = Store.all.map{|store| store.name}
---
SELECT "stores".* FROM "stores"