app/models/user.rb

    def create_customer
        if self.customer?
            response = Nif.new(self.identity_number).call
            data = response['data']

            profile = Profile.create(
                user_id:   self.id,
                bi:        data['ID_NUMBER'],
                name:      data['FIRST_NAME'],
                last_name: data['LAST_NAME'],
                genre:     data['GENDER_NAME'] == 'MASCULINO' ? 0 : 1 ,
                birth:     data['BIRTH_DATE'],
                address:   data['RESIDENCE_NEIGHBOR'],
                province:  data['RESIDENCE_PROVINCE_NAME'],
                residence: data['RESIDENCE_ADDRESS']
            )

            Adc.create(profile_id: profile.id)
---
INSERT INTO "adcs" ("reference", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["reference", "ADC01386/2021"], ["created_at", "2021-12-16 13:38:35.108693"], ["updated_at", "2021-12-16 13:38:35.108693"]]

    def any_purchase_active?
        self.purchase_codes.where(is_active: true).exists?
---
SELECT "users".* FROM "users" WHERE (lower(cell_phone) = 'manucabanga@gmail.com' OR lower(email) = 'manucabanga@gmail.com') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]